#Math Lecture 2 - determinant matrix, range, actions

#calculate determinant 2x2
import numpy as np
A = np.array(
    [[1, 2],
     [3, 4]]
    )
print(round(np.linalg.det(A)))
# -2

#calculate determinant 3x3
#Вираз визначника третього порядку є досить громіздким. 
#Для запам'ятовування формули використовують «правило трикутника» або «правило Саррюса».
# a11a22a33+a12a23a31+a13a21a32−a13a22a31−a11a23a32−a12a21a33.
import numpy as np
A = np.array(
    [[4, -5, 7],
     [1, -4, 9],
     [-4, 0, 5],
     ]
    )
print(round(np.linalg.det(A)))
# 13

#Властивості детермінантів
#Властивість 1 - Визначник не змінюється під час транспонування матриці.
#Властивість 2 - Якщо матриця містить рядок, що складається з нулів, її визначник дорівнює нулю.
#Властивість 3 - Якщо в матриці поміняти місцями якісь два рядки, то її визначник змінить знак на протилежний.
#Властивість 4 - Якщо матриця має два однакові рядки, то її визначник дорівнює нулю.
#Властивість 5 - При множенні рядка матриці на число її визначник множиться на це число.
#Властивість 6 - Якщо всі елементи i-го рядка матриці представлені у вигляді суми двох
#                доданків aij=bj+cjaij=bj+cj, то її визначник дорівнює сумі визначників двох матриць,
#                у яких усі рядки, крім ii-го, такі самі, як і в заданій матриці А, а ii-ий рядок
#Властивість 7 - Якщо один із рядків матриці є лінійною комбінацією інших рядків цієї матриці, то її визначник дорівнює нулю.
#Властивість 8 -  

